In [1]:
#Importing the library
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import datasets

In [2]:
#Getting the data
data=pd.read_csv('0000000000002429_training_titanic_x_y_train.csv',delimiter=',')
data.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [3]:
#Explains the dataset
data.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [4]:
data.shape

(668, 11)

# Cleaning of the training data

In [5]:
data.Age.fillna(data.Age.mean(),inplace=True)
new_data=pd.get_dummies(data,columns=['Sex','Embarked','Pclass'])
new_data=new_data.drop(['Name','Ticket','Cabin'], axis=1)
new_data['survived']=new_data['Survived']
del new_data['Survived']
z=np.array(new_data)

In [6]:
#Getting the x_train and y_train
x_train=z[:,:-1]
y_train=z[:,-1]

In [7]:
x_train.shape,y_train.shape

((668, 12), (668,))

In [8]:
#Getting the test data
x_test=pd.read_csv('0000000000002429_test_titanic_x_test.csv',delimiter=',')
x_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [9]:
#Shape of x_test
x_test.shape

(223, 10)

# Cleaning of test data

In [10]:
x_test.Age.fillna(x_test.Age.mean(),inplace=True)
new_x=pd.get_dummies(x_test,columns=['Sex','Embarked','Pclass'])
new_x=new_x.drop(['Name','Ticket','Cabin'], axis=1)
x_test=np.array(new_x)

# Logistic Regression

In [11]:
from sklearn.linear_model import LogisticRegression
clf=LogisticRegression(C=0.06)
clf

LogisticRegression(C=0.06, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [12]:
clf.fit(x_train,y_train)
y_pred=clf.predict(x_test) 
y_pred=np.array(y_pred)
np.savetxt("Predict.csv",y_pred)

In [13]:
clf.score(x_train,y_train)

0.7994011976047904